import os
import re
import jieba
import pandas as pd



from utils.utils import STRICT_REAR_KEYWORDS


rear_pattern = "|".join([f"{''.join([f'(?=.*{word})' for word in keyword.split('&')])}" for keyword in STRICT_REAR_KEYWORDS])

NEW_KEYWORD = ["鸡娃", "海淀妈妈", "网课", "遛娃", "神兽", "熊孩子", "虎妈", "父母&硬核", "式父母"]
new_rear_pattern = "|".join([f"{''.join([f'(?=.*{word})' for word in keyword.split('&')])}" for keyword in NEW_KEYWORD])


DELETE_KEYWORD = ["送子女神", "男子女", "女子女", "个子女", "见家长", "穿搭", "医务子女", "医护子女", "职工子女", "女友", "养我", "育儿假", "独生子女"]
delete_rear_pattern = "|".join(DELETE_KEYWORD)
delete_rear_pattern += "|见.{0,3}家长|医务.{0,3}子女|医护{0,3}子女"

# DELETE_KEYWORD = ["相亲"]
# 网课 not 爸妈 or 家长 or 妈妈 or 宅家上网课到底谁更难
# "熊孩子" not 爸妈 or 家长 or 父母 or 妈妈 or 爸爸 or 妈 or 奶奶
SAVE_KEYWORD = ["爸妈", "家长", "妈妈", "宅家上网课到底谁更难", "妈", "奶奶", "父母", "爸爸"]
save_rear_pattern = "|".join(SAVE_KEYWORD)

DELETE = [
    "韩国结婚五年内夫妻四成无子女",
    "波兰饺子女王",
    "法考生摆满零食供奉法界神兽",
    "2019花式被卡的熊孩子",
    "男孩子养了猫之后",
    "天气之子女主COS",
    "刘强东称将对不幸员工子女负责",
    "用家长会的方式打开公司例会",
    "患儿家长称封针治疗后病情加重",
    "幼儿园仅招干部三代以内直系子女",
    "冒充家长抢1岁男童",
    "67岁产妇子女未现身病房",
    "刘涛携子女登封面",
    "熊孩子卡手变话痨指导救援",
    "人大附中一家长因新冠肺炎离世",
    "北京回应人大附中一家长感染去世",
    "西安老人住院子女最多可休20天",
    "北京延期开学看护子女工资照发",
    "子女该支持离异父母再婚吗",
    "国内首例同性伴侣子女抚养案",
    "张文宏给学生家长提个醒",
    "熊孩子连掰14辆奔驰车标",
    "2岁女童因遛娃神器被挂电梯门上",
    "人大代表建议国家每月发育儿补贴",
    "伊能静儿子女装",
    "大头娃娃事件家长拒绝退一赔三",
    "悬崖村村民新家长啥样",
    "郴州大头娃娃事件家长发声",
    "鸭妈妈带娃过马路交警暖心护送",
    "国家卫健委发布高考防疫家长关键提示",
    "有义务抚养遭强奸所生的孩子吗",
    "梅姨案被拐儿童同案家长",
    "老板回应熊孩子尬舞扯翻翡翠柜台",
    "蒋南孙家长嫌弃章安仁",
    "京牌小客车向父母子女转移登记规则",
    "买家和卖家长达三年的较量",
    "2021年高考的烈士子女最多可加20分",
    "过年熊孩子拿捏术",
    "艺术家用光画山海经神兽",
    "一周内陕西3名熊孩子花式被卡",
    "家长诉饮料冒充奶粉致孩子智力残疾",
    "家长错把淫秽视频发班级群被拘",
    "建议明确离婚抢夺子女行为司法解释",
    "建议烈士见义勇为者子女医保全额报销",
    "新疆家长现场打脸外媒寄宿学校谣言",
    "国家公园拍到四川羚牛带娃",
    "95后摄影师还原山海经远古神兽",
    "虎妈妈不喂奶动物园找狗喂虎崽",
    "大学老师自制10米高神兽手办",
    "情侣约会偶遇野猪遛娃",
    "成都理工回应设恐龙养育专业系谣言",
    "美科学家长期研究人工冠状病毒合成",
    "加大力度打击出卖亲生子女犯罪",
    "男子耗时9年还原60只山海经神兽",
    "90后女孩用3D插画还原山海经神兽",
    "东北虎豹国家公园现神兽",
    "江苏60岁父母住院子女可带薪护理",
    "4名志愿者防护服上画四大神兽",
    "三星堆铜神兽酷似机器狗",
    "三星堆神兽酷似小猪佩奇吹风机",
    "博物馆神兽瞪眼皱眉似社恐营业",
    "三星堆又提取出一件大神兽",
    "三星堆发现第一件带翅膀神兽",
    "三星堆新神兽像狗长兔耳朵",
    "厦大教授建议按子女数领养老金",
    "金晓宇说书就是我的子女",
    "做好随迁子女就学工作",
    "北京未成年子女较多家庭将优先配租公租房",
    "老太患阿尔兹海默症后子女不愿赡养",
    "京牌小客车向子女转移登记不能保留原号牌",
    "白岩松建议确保落实非婚生子女权利",
    "广东5月起生育子女无须再审批",
    "母亲30多年前离家现起诉子女要赡养费",
    "陕西某地工作人员称县委子女隔离餐免费",
    "高校回应招聘3名教师2人是领导子女",
    "加强对在校烈士子女的关心关爱",
    "子女清理遗物时发现他竟是个大英雄",
    "父母失信影响子女上大学系误读",
    "老人沉迷买保健品子女无奈报警",
    "领导干部子女的配偶经商也需报告",
    "全州超生子女被抱走一事已上报市政府处理",
    "卫健委回应网传超生子女调剂告知书",
    "官方回应禁止电诈人员子女上公立小学",
    "住房政策向多子女家庭倾斜",
    "侵华日军的子女将到中国养老",
    "团伙专挑老人子女不在身边时行骗",
    "室友送柚子女生用皮做玫瑰花回赠",
    "房产继承因已故妹妹无子女证明被卡",
    "成都父母投靠成年子女入户可再购一套房",
    "2021年高考的烈士子女最多可加20分",
    "建议烈士见义勇为者子女医保全额报销",
    "山东随迁子女高考享均等入学机会",
    "酒驾影响个人信用子女读书",
    "吴宣仪 这个圈子女孩不被善待",
    "张恒 我赢得儿子女儿抚养独立决定权",
    "102岁老人状告5子女不赡养",
    "子女去世要瞒住老人吗",
    "官方回应中学预录取3名高管子女",
    "今起夫妻过户子女继承免征契税",
    "子女需要对父母的过错负责吗",
    "警察配偶子女经商办企业禁业范围",
    "鼓励随迁子女仅凭居住证入学",
    "鼓励成年子女与老年父母就近居住",
    "如何看待被拐子女往往选择养父母",
    "西安老人住院子女最多可休20天",
    "北京延期开学看护子女工资照发",
    "99岁老人哭诉被子女强辞保姆",
    "幼儿园仅招干部三代以内直系子女",
    "上海豫园灯会复原山海经神兽",
    "孟鹤堂和神兽住在山海经",
    "赵丽颖周深陈立农用神兽祝福新年",
    "顶尊跪坐人像和神兽首次合体",
    "龙抬头的龙不是神兽是星宿",
    "我国最早的壁画上有4只神兽",
    "三星堆新神兽像只熬夜猫头鹰",
    "宋祖儿茄子女孩",
    "杭州中考取消外籍华人的子女加分",
    "老人摔下梯子女婿第一时间赶回",
    "建议消除对罪犯子女考公的限制",
    "罪犯子女考公限制应该消除吗",
    "建议消除对罪犯子女考公的限制",
    "建议父母满65岁给子女陪护假",
    "建议随迁子女就地入学",
    "罪犯子女考公限制应该消除吗",
    "罪犯子女考公限制要不要取消",
    "纪委通报一县在官员子女打印店花174万",
    "因男生秋裤裆部贴到被子女生将其秋裤剪烂",
    "韩国多子女公务员可优先晋升",
    "厦门多子女家庭第二套住房认定为首套",
    "哈佛大学被曝为权贵子女开后门"
]

for year in ["2019", "2020", "2021", "2022", "2023"]:
    for month in range(1, 13):
        month_str = f"{year}-{month:02d}"

        file_path = f"bangdan_working_data/{month_str}_strict2.csv"
        if not os.path.exists(file_path):
            continue
        print(f"processing {file_path}")

        # 用pandas读取df，手动指定列明
        df = pd.read_csv(file_path)
        df["rear"] = df["rear"].astype(int)
        
        # 遍历每一行，如果text中包含严格育儿关键词，则将rear列置为1，否则要改为0（用正则）
        for index, row in df.iterrows():
            if row["rear"] == 0:
                continue
            else:
                if row["text"] in DELETE:
                    df.loc[index, "rear"] = 0
                # elif ("熊孩子" in row["text"] or "网课" in row["text"]) and not re.search(save_rear_pattern, row["text"]):
                #     df.loc[index, "rear"] = 0
                continue

        new_file_path = f"bangdan_working_data/{month_str}_strict2.csv"
        df.to_csv(new_file_path, index=False)

